; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v13 ?v7)
             (pred_2 ?v5 ?v9)
             (pred_8 ?v13 ?v9)
             (pred_6 ?v6 ?v13 )
	     (pred_1 ?v13)
             (pred_7 ?v8)
             (pred_3 ?v5)
             (pred_9 ?v9)
             (pred_11 ?v13)
             (pred_4 ?v5)
             (pred_12 ?v13)
             (pred_10 ))



(:action op_3
:parameters (?v2 ?v1 ?v3 ?v10)
:precondition (and (pred_7 ?v2) (pred_7 ?v1) (pred_3 ?v3) (pred_9 ?v10)
          (pred_5 ?v2 ?v1) (pred_2 ?v3 ?v10)
                   (pred_8 ?v1 ?v10) (pred_1 ?v2) 
                   (pred_11 ?v1) (pred_4 ?v3))
:effect (and  (pred_12 ?v1) (not (pred_11 ?v1))))


(:action op_4
:parameters (?v2 ?v4)
:precondition (and (pred_7 ?v2) (pred_7 ?v4)
               (pred_1 ?v2) (pred_5 ?v2 ?v4) (pred_12 ?v4))
:effect (and (pred_1 ?v4) (not (pred_1 ?v2))))

(:action op_1
:parameters (?v2 ?v3)
:precondition (and (pred_7 ?v2) (pred_3 ?v3) 
                  (pred_1 ?v2) (pred_6 ?v3 ?v2) (pred_10 ))
:effect (and (pred_4 ?v3)
   (not (pred_6 ?v3 ?v2)) (not (pred_10 ))))


(:action op_5
:parameters (?v2 ?v11 ?v12)
:precondition (and (pred_7 ?v2) (pred_3 ?v11) (pred_3 ?v12)
                  (pred_1 ?v2) (pred_4 ?v12) (pred_6 ?v11 ?v2))
:effect (and (pred_4 ?v11) (pred_6 ?v12 ?v2)
        (not (pred_4 ?v12)) (not (pred_6 ?v11 ?v2))))

(:action op_2
:parameters (?v2 ?v3)
:precondition (and (pred_7 ?v2) (pred_3 ?v3) 
                  (pred_1 ?v2) (pred_4 ?v3))
:effect (and (pred_10 ) (pred_6 ?v3 ?v2) (not (pred_4 ?v3)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_20 obj_05 obj_18 obj_04 obj_09 obj_17 obj_06 obj_03 obj_12 obj_15 obj_01 obj_14 obj_13 obj_11 obj_16 obj_10
    obj_02 obj_19
    obj_08 obj_07
    )

    (:init
       (pred_10)

       (pred_7 obj_20)
       (pred_7 obj_05)
       (pred_7 obj_18)
       (pred_7 obj_04)
       (pred_7 obj_09)
       (pred_7 obj_17)
       (pred_7 obj_06)
       (pred_7 obj_03)
       (pred_7 obj_12)
       (pred_7 obj_15)
       (pred_7 obj_01)
       (pred_7 obj_14)
       (pred_7 obj_13)
       (pred_7 obj_11)
       (pred_7 obj_16)
       (pred_7 obj_10)
       (pred_9 obj_02)
       (pred_9 obj_19)
       (pred_3 obj_08)
       (pred_3 obj_07)

       (pred_5 obj_20 obj_09)
       (pred_5 obj_20 obj_05)
       (pred_5 obj_05 obj_17)
       (pred_5 obj_05 obj_18)
       (pred_5 obj_05 obj_20)
       (pred_5 obj_18 obj_06)
       (pred_5 obj_18 obj_04)
       (pred_5 obj_18 obj_05)
       (pred_5 obj_04 obj_03)
       (pred_5 obj_04 obj_18)
       (pred_5 obj_09 obj_12)
       (pred_5 obj_09 obj_17)
       (pred_5 obj_09 obj_20)
       (pred_5 obj_17 obj_15)
       (pred_5 obj_17 obj_06)
       (pred_5 obj_17 obj_05)
       (pred_5 obj_17 obj_09)
       (pred_5 obj_06 obj_01)
       (pred_5 obj_06 obj_03)
       (pred_5 obj_06 obj_18)
       (pred_5 obj_06 obj_17)
       (pred_5 obj_03 obj_14)
       (pred_5 obj_03 obj_04)
       (pred_5 obj_03 obj_06)
       (pred_5 obj_12 obj_13)
       (pred_5 obj_12 obj_15)
       (pred_5 obj_12 obj_09)
       (pred_5 obj_15 obj_11)
       (pred_5 obj_15 obj_01)
       (pred_5 obj_15 obj_17)
       (pred_5 obj_15 obj_12)
       (pred_5 obj_01 obj_16)
       (pred_5 obj_01 obj_14)
       (pred_5 obj_01 obj_06)
       (pred_5 obj_01 obj_15)
       (pred_5 obj_14 obj_10)
       (pred_5 obj_14 obj_03)
       (pred_5 obj_14 obj_01)
       (pred_5 obj_13 obj_11)
       (pred_5 obj_13 obj_12)
       (pred_5 obj_11 obj_16)
       (pred_5 obj_11 obj_15)
       (pred_5 obj_11 obj_13)
       (pred_5 obj_16 obj_10)
       (pred_5 obj_16 obj_01)
       (pred_5 obj_16 obj_11)
       (pred_5 obj_10 obj_14)
       (pred_5 obj_10 obj_16)
       (pred_11 obj_15)
       (pred_11 obj_10)
       (pred_8  obj_15 obj_02)
       (pred_8  obj_10 obj_19)
       (pred_12 obj_20)
       (pred_12 obj_05)
       (pred_12 obj_18)
       (pred_12 obj_04)
       (pred_12 obj_09)
       (pred_12 obj_17)
       (pred_12 obj_06)
       (pred_12 obj_03)
       (pred_12 obj_12)
       (pred_12 obj_01)
       (pred_12 obj_14)
       (pred_12 obj_13)
       (pred_12 obj_11)
       (pred_12 obj_16)

       (pred_2  obj_08 obj_02)
       (pred_2  obj_07 obj_19)
       (pred_6 obj_08 obj_05)
       (pred_6 obj_07 obj_14)
       (pred_1 obj_11)
    )

    (:goal (and
       (pred_6 obj_08 obj_20)
       (pred_6 obj_07 obj_18)
    ))
(:constraints
  (always (not (pred_1 obj_01)))
)
)

; plan
1. (op_4 obj_11 obj_13)
   deleted: (pred_1 obj_11)
   added: (pred_1 obj_13)
   goals met: 0 of 2
2. (op_4 obj_13 obj_12)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_12)
   goals met: 0 of 2
3. (op_4 obj_12 obj_09)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_09)
   goals met: 0 of 2
4. (op_4 obj_09 obj_20)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_20)
   goals met: 0 of 2
5. (op_4 obj_20 obj_05)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_05)
   goals met: 0 of 2
6. (op_1 obj_05 obj_08)
   deleted: (pred_6 obj_08 obj_05) (pred_10)
   added: (pred_4 obj_08)
   goals met: 0 of 2
7. (op_4 obj_05 obj_20)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_20)
   goals met: 0 of 2
8. (op_2 obj_20 obj_08)
   deleted: (pred_4 obj_08)
   added: (pred_10) (pred_6 obj_08 obj_20)
   goals met: 1 of 2
9. (op_4 obj_20 obj_05)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_05)
   goals met: 1 of 2
10. (op_4 obj_05 obj_18)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_18)
   goals met: 1 of 2
11. (op_4 obj_18 obj_04)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_04)
   goals met: 1 of 2
12. (op_4 obj_04 obj_03)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_03)
   goals met: 1 of 2
13. (op_4 obj_03 obj_14)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_14)
   goals met: 1 of 2
14. (op_1 obj_14 obj_07)
   deleted: (pred_6 obj_07 obj_14) (pred_10)
   added: (pred_4 obj_07)
   goals met: 1 of 2
15. (op_4 obj_14 obj_03)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_03)
   goals met: 1 of 2
16. (op_4 obj_03 obj_04)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_04)
   goals met: 1 of 2
17. (op_4 obj_04 obj_18)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_18)
   goals met: 1 of 2
18. (op_2 obj_18 obj_07)
   deleted: (pred_4 obj_07)
   added: (pred_10) (pred_6 obj_07 obj_18)
   goals met: 2 of 2
